In [1]:
import pandas as pd
import numpy as np

In [2]:
#Merge - When DataFrames are not in the exact same order or format, they can not be concatenated and have to be merged

In [6]:
registrations = pd.DataFrame({'reg_id': [1, 2, 3, 4], 'name': ['Andrew', 'Bob', 'Clair', 'David']})
logins = pd.DataFrame({'log_id': [1, 2, 3, 4], 'name': ['Luke', 'Andrew', 'Megan', 'Bob']})

In [7]:
registrations

   reg_id    name
0       1  Andrew
1       2     Bob
2       3   Clair
3       4   David

In [8]:
logins

   log_id    name
0       1    Luke
1       2  Andrew
2       3   Megan
3       4     Bob

In [10]:
#help(pd.merge)

In [13]:
#Inner join will look for matches in both DF's - Will only take values present in both tables

In [14]:
pd.merge(registrations, logins, how='inner', on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2     Bob       4

In [22]:
#Left and right merges - Order of DF's being passed in does matter 
#If values don't exist in both DF's it will be passed in as NAN

In [19]:
pd.merge(registrations, logins, how='left', on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2     Bob     4.0
2       3   Clair     NaN
3       4   David     NaN

In [20]:
pd.merge(registrations, logins, how='right', on='name')

   reg_id    name  log_id
0     NaN    Luke       1
1     1.0  Andrew       2
2     NaN   Megan       3
3     2.0     Bob       4

In [23]:
#Outer Merge - Fill everything at once regardless of missing values

In [25]:
pd.merge(registrations, logins, how='outer', on='name')

   reg_id    name  log_id
0     1.0  Andrew     2.0
1     2.0     Bob     4.0
2     3.0   Clair     NaN
3     4.0   David     NaN
4     NaN    Luke     1.0
5     NaN   Megan     3.0

In [27]:
#Joining on rows (indexes) instead of columns

In [28]:
registrations = registrations.set_index('name')

In [29]:
registrations

        reg_id
name
Andrew       1
Bob          2
Clair        3
David        4

In [33]:
#left/right_on stand for columns, left/right_index stand for rows
pd.merge(registrations, logins, left_index=True, right_on='name', how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4     Bob

In [34]:
registrations = registrations.reset_index()

In [35]:
registrations

     name  reg_id
0  Andrew       1
1     Bob       2
2   Clair       3
3   David       4

In [36]:
registrations.columns = ['reg_name', 'reg_id']

In [37]:
registrations

  reg_name  reg_id
0   Andrew       1
1      Bob       2
2    Clair       3
3    David       4

In [38]:
pd.merge(registrations, logins, how='inner', left_on="reg_name", right_on='name')

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1      Bob       2       4     Bob

In [47]:
#Pandas recognises duplicate columns

In [48]:
registrations.columns = ['name', 'id']

In [49]:
logins.columns = ['id', 'name']

In [53]:
pd.merge(registrations, logins, how='inner', on='name', suffixes=('_reg', '_log'))

     name  id_reg  id_log
0  Andrew       1       2
1     Bob       2       4